read -sv ../hdl/admo_alu.v
hierarchy -top admo_alu; 
proc_arst
proc_dff
memory
techmap
opt
proc
abc -g cmos
stat -tech cmos
shell